Kaggle titanic 데이터를 활용한 EDA 연습  
참고 링크 : https://www.kaggle.com/code/kalelpark/kaggle-titanic-for-korean

In [12]:
# 데이터 분석 및 다루기(data analysis and wrangling)
import pandas as pd
import numpy as np
import random as rnd

# 데이터 시각화(visualization)
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# 머신러닝(machine learning)
from sklearn.linear_model import LogisticRegression
from sklearn.svm import SVC, LinearSVC
from sklearn.ensemble import RandomForestClassifier
from sklearn.neighbors import KNeighborsClassifier
from sklearn.naive_bayes import GaussianNB
from sklearn.linear_model import Perceptron
from sklearn.linear_model import SGDClassifier
from sklearn.tree import DecisionTreeClassifier

In [2]:

train_df = pd.read_csv('./content/titanic/train.csv')
test_df = pd.read_csv('./content/titanic/test.csv')
combine = [train_df , test_df]

In [3]:
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
# DataFrame.describe() 을 사용하면 수치형 데이터만을 알려주지만,  include = ['O'] 를 지정하면, 범주형 데이터를 알려준다.

# train_df.describe()
train_df.describe(include = ['O'])

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [5]:
train_df.columns.values

array(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'], dtype=object)

In [6]:
train_df.groupby('Pclass',as_index=False).count()

,Pclass,PassengerId,Survived,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,216,216,216,216,186,216,216,216,216,176,214
1,2,184,184,184,184,173,184,184,184,184,16,184
2,3,491,491,491,491,355,491,491,491,491,12,491

In [7]:
# chained indexing??? 

train_df.groupby('Pclass',as_index=False).mean('Survived')[['Age','Survived']]

         Age  Survived
0  38.233441  0.629630
1  29.877630  0.472826
2  25.140620  0.242363

In [8]:
train_df.loc[:,['Pclass', 'Survived']].groupby('Pclass',as_index=False).sum('Survived')

   Pclass  Survived
0       1       136
1       2        87
2       3       119

In [9]:
train_df[['Pclass', 'Survived']].groupby(['Pclass'], as_index = False)\
    .mean().sort_values(by = 'Survived', ascending = False)

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363